# Pandas

In [ ]:
import pandas as pd
import numpy as np

# Pandas Series

Series es un objeto unidimensional (1D) similar a la columna de una tabla. Si queremos crear un Series para un listado de nombres, podemos hacer lo siguiente:

In [ ]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [ ]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [ ]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(data=labels, index=my_list)

10    a
20    b
30    c
dtype: object

In [ ]:
pd.Series(data=arr)

0    10
1    20
2    30
dtype: int32

In [ ]:
pd.Series(data=d)

a    10
b    20
c    30
dtype: int64

# Pandas DataFrame

El DataFrame es una estructura de datos tabular que se compone de columnas y filas ordenadas

In [ ]:
import numpy as np
from numpy.random import randn

In [ ]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [ ]:
df

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B -0.866017 -1.226471 -0.454042 -0.332420
C -0.068621 -0.465132 -0.770859 -0.940638
D -0.177488  0.772010 -2.167630  0.258074
E -0.668570  0.190081  1.111359  0.106962

In [ ]:
df['W']

A    0.141582
B   -0.866017
C   -0.068621
D   -0.177488
E   -0.668570
Name: W, dtype: float64

In [ ]:
df[['W']]

          W
A  0.141582
B -0.866017
C -0.068621
D -0.177488
E -0.668570

In [ ]:
df[['Y','W']]

          Y         W
A  1.275226  0.141582
B -0.454042 -0.866017
C -0.770859 -0.068621
D -2.167630 -0.177488
E  1.111359 -0.668570

In [ ]:
df

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B -0.866017 -1.226471 -0.454042 -0.332420
C -0.068621 -0.465132 -0.770859 -0.940638
D -0.177488  0.772010 -2.167630  0.258074
E -0.668570  0.190081  1.111359  0.106962

In [ ]:
df['new'] = df['W'] + df['Y']

In [ ]:
df

          W         X         Y         Z       new
A  0.141582  1.088916  1.275226  2.076367  1.416808
B -0.866017 -1.226471 -0.454042 -0.332420 -1.320060
C -0.068621 -0.465132 -0.770859 -0.940638 -0.839480
D -0.177488  0.772010 -2.167630  0.258074 -2.345118
E -0.668570  0.190081  1.111359  0.106962  0.442789

In [ ]:
list(df.columns)

['W', 'X', 'Y', 'Z', 'new']

## Drop

In [ ]:
df1 = df.drop('new', axis=1)
# axis = 0     filas
# axis = 1     columnas
df

          W         X         Y         Z       new
A  0.141582  1.088916  1.275226  2.076367  1.416808
B -0.866017 -1.226471 -0.454042 -0.332420 -1.320060
C -0.068621 -0.465132 -0.770859 -0.940638 -0.839480
D -0.177488  0.772010 -2.167630  0.258074 -2.345118
E -0.668570  0.190081  1.111359  0.106962  0.442789

In [ ]:
df1

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B -0.866017 -1.226471 -0.454042 -0.332420
C -0.068621 -0.465132 -0.770859 -0.940638
D -0.177488  0.772010 -2.167630  0.258074
E -0.668570  0.190081  1.111359  0.106962

In [ ]:
df.drop('new', axis=1,inplace=True)

In [ ]:
df

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B -0.866017 -1.226471 -0.454042 -0.332420
C -0.068621 -0.465132 -0.770859 -0.940638
D -0.177488  0.772010 -2.167630  0.258074
E -0.668570  0.190081  1.111359  0.106962

In [ ]:
df.drop('E', axis=0,inplace=True)

In [ ]:
df

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B -0.866017 -1.226471 -0.454042 -0.332420
C -0.068621 -0.465132 -0.770859 -0.940638
D -0.177488  0.772010 -2.167630  0.258074

In [ ]:
df['W']

A    0.141582
B   -0.866017
C   -0.068621
D   -0.177488
Name: W, dtype: float64

In [ ]:
df.loc['B']

W   -0.866017
X   -1.226471
Y   -0.454042
Z   -0.332420
Name: B, dtype: float64

In [ ]:
df.iloc[1]

W   -0.866017
X   -1.226471
Y   -0.454042
Z   -0.332420
Name: B, dtype: float64

In [ ]:
df

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B -0.866017 -1.226471 -0.454042 -0.332420
C -0.068621 -0.465132 -0.770859 -0.940638
D -0.177488  0.772010 -2.167630  0.258074

In [ ]:
df>0

       W      X      Y      Z
A   True   True   True   True
B  False  False  False  False
C  False  False  False  False
D  False   True  False   True

In [ ]:
df[df>0]

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B       NaN       NaN       NaN       NaN
C       NaN       NaN       NaN       NaN
D       NaN  0.772010       NaN  0.258074

In [ ]:
df2 = df[df>0]
df2

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367
B       NaN       NaN       NaN       NaN
C       NaN       NaN       NaN       NaN
D       NaN  0.772010       NaN  0.258074

In [ ]:
df[df['W']>0]

          W         X         Y         Z
A  0.141582  1.088916  1.275226  2.076367

In [ ]:
df[df['W']>0]['Y']

A    1.275226
Name: Y, dtype: float64

In [ ]:
df[df['W']>0][['Y','X']]

          Y         X
A  1.275226  1.088916

In [ ]:
df[(df['Z']>0) & (df['Z']<1)][['Y','X']]

         Y        X
D -2.16763  0.77201

# Missing data

In [ ]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [ ]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [ ]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [ ]:
df.dropna(axis=1, inplace=True)
df

   C
0  1
1  2
2  3

In [ ]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [ ]:
df.fillna(value='val')

     A    B  C
0    1    5  1
1    2  val  2
2  val  val  3

In [ ]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [ ]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [ ]:
df = pd.DataFrame(data)

In [ ]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [ ]:
df.groupby('Company')

In [ ]:
gb=df.groupby('Company')

In [ ]:
gb.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [ ]:
gb.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [ ]:
gb.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [ ]:
gb.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
Company    6 non-null object
Person     6 non-null object
Sales      6 non-null int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [ ]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [ ]:
gb.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [ ]:
gb.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [ ]:
gb.describe().transpose()[['FB']]

Company              FB
Sales count    2.000000
      mean   296.500000
      std     75.660426
      min    243.000000
      25%    269.750000
      50%    296.500000
      75%    323.250000
      max    350.000000

# Concatenating

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 

df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [ ]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
pd.concat([df2,df1,df3])

      A    B    C    D
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
df_p=pd.concat([df2,df1,df3])
df_p

      A    B    C    D
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
df_p.reset_index(drop=True)

      A    B    C    D
0    A4   B4   C4   D4
1    A5   B5   C5   D5
2    A6   B6   C6   D6
3    A7   B7   C7   D7
4    A0   B0   C0   D0
5    A1   B1   C1   D1
6    A2   B2   C2   D2
7    A3   B3   C3   D3
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [ ]:
pd.concat([df2,df1,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0   NaN  NaN  NaN  NaN   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   NaN  NaN  NaN  NaN   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   NaN  NaN  NaN  NaN   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   NaN  NaN  NaN  NaN   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4    A4   B4   C4   D4  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
5    A5   B5   C5   D5  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
6    A6   B6   C6   D6  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
7    A7   B7   C7   D7  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Operaciones

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [ ]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [ ]:
df.head(2)

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [ ]:
df.tail(2)

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [ ]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [ ]:
df['col2'].nunique()

3

In [ ]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [ ]:
type(df['col2'].value_counts())

pandas.core.series.Series

In [ ]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [ ]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [ ]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [ ]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [ ]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and output

In [ ]:
df = pd.read_csv('example')

In [ ]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [ ]:
df.to_csv('example_out.csv')